$(function () { //////////// JQB ////////////////////////////////////////
    console.log("사이즈 JS 로딩완료!");
    // width값을 가져오기
    var wize = window.outerWidth;

    // 320 이하인지 if문으로 확인(나중에 모바일 최소 사이즈로 변경!)
    if (wize <= 320) {
        console.log('현재 브라우저 크기가 320px 이하');
        $(".newTop").css({
            backgroundColor : "blue"
        }); // css ////
    }
}); ///////////// JQB /////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////
