/// 서브메뉴 사이트 공통 JS ///

$(function () { /////////jQB ///////////////////////////////
    console.log("로딩완료!");

    //// 전역변수 구역 ///////////////
    // 스크롤사용금지 설정(0-허용,1-금지)
    var scNo = 0;
    //////////////////////////////




    ////////// 스크롤 이벤트 함수/////////////////////////////////////////////

    // 헤더 높이값
    var headerH = $(".top").height();
    console.log("헤더높이:" + headerH);

    // 사이드메뉴 너비
    var sideMW = $("#side_menu_wrap").width();
    console.log("사이드메뉴너비:" + sideMW);

    // 전체 콘텐츠랩 너비
    var conW = $("#bedroom_content_wrap").width();
    console.log("컨텐츠너비:" + conW);

    // 탑메뉴 변경 실행여부 체크 상태변수
    var tChange = 0; // 0 : 실행전 , 1 : 실행후

    ///////////배너 밀어주기///////////
    //    $("#bedroom_content_area").css({
    //        marginTop: 0
    //    }); //////css/////////////
    /////////////////////////////////


    $("#side_menu_wrap").find("div").hide();
    ///////////////////////////////////////////////////////////////////////
    $(window).scroll(function () {

        var scTop = $(this).scrollTop();
        console.log("스크롤위치:" + scTop);
        /////////////////////////////////////////////
        ///////// 헤더 스크롤 이벤트 //////////////////


        ///// 탑메뉴 상단에 고정하기 ////////
        // 위치 : 기존헤더 크기를 넘어갈때
        if (scTop > headerH && tChange === 0) {
            tChange = 1; //잠금(한번만 실행)
            //console.log("헤더변경!");
            $("#side_menu_wrap").css({
                transform: "translateX(0)",
                width: "15%"
            }); //// css ///////
            
            $("#side_menu_wrap").find("div").fadeIn(600).delay(400);
            $("#bedroom_content_wrap").css({
                top: -headerH
            }); //// css /////////

        } ///// if ////////////////////////
        //// 맨위로 돌아갈때 원상복구하기 /////
        else if (scTop < (headerH - 100) && tChange === 1) {
            tChange = 0; // 잠금(반대로!)
            // 1. 먼저 위로 숨기기 애니메이션
            $(".top").animate({
                top: "-160px"
            }, 100, "easeOutQuart", function () {
                //애니후
                // 2. 원래 포지션위치 변경하기
                $(this).animate({
                    position: "absolute",
                    top: "0"
                }).removeClass("newTop"); //3.클래스제거
            }); //////// animate ////////////
            // 2. .top 디자인 수정하기
            $(".top").css({
                margin: "0",
                left: "7.5%"
            }); //// css /////////////////

            //            $(".newTop").css({
            //                left: "auto",
            //                right: "0"
            //            }); //// css /////////////////



        } /////// else if /////////////////////
        ///////////////////////////////////////

        ///////// 헤더 스크롤 이벤트 //////////////////
        /////////////////////////////////////////////

        ////////////////////////////////////////////
        ///// 스크롤 무빙 이벤트 /////////////////////


    }); /////// scroll ////////////




}); ///// jQB ///////////////////////////////////
